-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 17, 2023 at 10:47 AM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.0.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `muta`
--

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `order_id` int(11) NOT NULL,
  `menu` text DEFAULT NULL,
  `price` int(11) DEFAULT NULL,
  `count` int(11) DEFAULT NULL,
  `total_price` int(11) DEFAULT NULL,
  `ref_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`order_id`, `menu`, `price`, `count`, `total_price`, `ref_id`) VALUES
(1, 'เครื่องดื่มไม่อั้น', 200, 2, 400, 1),
(2, 'ไอศกรีมไม่อั้น', 300, 2, 600, 2),
(3, '1', 2, 3, 4, 5),
(4, '1', 2, 3, 4, 5),
(7, 'ไอศกรีมไม่อั้น', 30, 2, 60, 5),
(8, 'ไอศกรีมไม่อั้น', 30, 2, 60, 1),
(9, 'ไอศกรีมไม่อั้น', 30, 2, 60, 2),
(10, 'ไอศกรีมไม่อั้น', 30, 2, 60, 3),
(11, 'ไอศกรีมไม่อั้น', 30, 2, 60, 6),
(12, 'เครื่องดื่มไม่อั้น', 30, 2, 60, 1),
(13, 'เครื่องดื่มไม่อั้น', 30, 2, 60, 2),
(14, 'เครื่องดื่มไม่อั้น', 30, 2, 60, 3),
(15, 'เครื่องดื่มไม่อั้น', 30, 2, 60, 4),
(16, 'เครื่องดื่มไม่อั้น', 30, 2, 60, 5),
(17, 'ชุดเล็กอิ่มคุ้ม', 59, 1, 59, 1),
(18, 'ชุดเล็กอิ่มคุ้ม', 59, 1, 59, 2),
(19, 'ชุดเล็กอิ่มคุ้ม', 59, 1, 59, 3),
(20, 'ชุดเล็กอิ่มคุ้ม', 59, 1, 59, 4),
(21, 'ชุดใหญ่อิ่มคุ้ม', 129, 1, 129, 1),
(22, 'ชุดใหญ่อิ่มคุ้ม', 129, 1, 129, 2),
(23, 'บุฟเฟต์ผู้ใหญ่', 159, 1, 159, 2),
(24, 'บุฟเฟต์ผู้ใหญ่', 159, 1, 159, 3),
(25, 'บุฟเฟต์ผู้ใหญ่', 159, 1, 159, 4),
(26, 'บุฟเฟต์ผู้ใหญ่', 159, 1, 159, 5),
(27, 'ไก่', 239, 5, 1000, 8),
(28, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 0, 0),
(29, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 0, 0),
(30, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 0, 41),
(31, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 0, 41),
(32, 'ชุดเล็กอิ่มคุ้ม (59 บาท)', 59, 1, 0, 41),
(33, 'บุฟเฟต์เด็ก (109 บาท)', 109, 1, 0, 41),
(34, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 0, 41),
(35, 'ชุดเล็กอิ่มคุ้ม (59 บาท)', 59, 1, 0, 41),
(36, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 89, 41),
(37, 'ชุดเล็กอิ่มคุ้ม (59 บาท)', 59, 1, 89, 41),
(38, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 129, 0),
(39, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 247, 0),
(40, 'ชุดเล็กอิ่มคุ้ม (59 บาท)', 59, 2, 247, 0),
(41, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 2, 120, 0),
(42, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 2, 120, 0),
(43, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 2, 516, 41),
(44, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 2, 516, 41),
(45, '1', 2, 3, 4, 5),
(46, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 2, 516, 41),
(47, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 2, 516, 41),
(51, 'บุฟเฟต์เด็ก (109 บาท)', 109, 1, 109, 66),
(52, 'ชุดเล็กอิ่มคุ้ม (59 บาท)', 59, 1, 596, 67),
(53, 'ไอศกรีมไม่อั้น (30 บาท)', 30, 2, 596, 67),
(54, 'บุฟเฟต์ผู้ใหญ่ (159 บาท)', 159, 3, 596, 67),
(55, 'บุฟเฟต์เด็ก (109 บาท)', 109, 1, 784, 68),
(56, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 2, 784, 68),
(57, 'บุฟเฟต์ผู้ใหญ่ (159 บาท)', 159, 1, 784, 68),
(58, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 2, 784, 68),
(59, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 258, 69),
(60, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 258, 69),
(61, 'ไอศกรีมไม่อั้น (30 บาท)', 30, 2, 90, 70),
(62, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 90, 70),
(63, 'ไอศกรีมไม่อั้น (30 บาท)', 30, 2, 90, 71),
(64, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 90, 71),
(65, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 288, 72),
(66, 'ไอศกรีมไม่อั้น (30 บาท)', 30, 1, 288, 72),
(67, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 288, 72),
(68, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 30, 73),
(69, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 30, 74),
(70, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 30, 75),
(71, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 30, 78),
(72, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 30, 79),
(73, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 30, 80),
(74, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 30, 80),
(75, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 30, 81),
(76, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 159, 82),
(77, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 159, 82),
(78, 'บุฟเฟต์ผู้ใหญ่ (159 บาท)', 159, 1, 795, 83),
(79, 'บุฟเฟต์ผู้ใหญ่ (159 บาท)', 159, 2, 795, 83),
(80, 'บุฟเฟต์ผู้ใหญ่ (159 บาท)', 159, 1, 795, 83),
(81, 'บุฟเฟต์ผู้ใหญ่ (159 บาท)', 159, 1, 795, 83),
(82, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 2, 318, 84),
(83, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 2, 318, 84),
(84, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 387, 85),
(85, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 387, 85),
(86, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 387, 85),
(87, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 258, 86),
(88, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 258, 86),
(89, 'ชุดเล็กอิ่มคุ้ม (59 บาท)', 59, 1, 59, 87),
(90, 'ชุดเล็กอิ่มคุ้ม (59 บาท)', 59, 1, 59, 87),
(91, 'บุฟเฟต์เด็ก (109 บาท)', 109, 2, 218, 88),
(92, 'บุฟเฟต์เด็ก (109 บาท)', 109, 1, 109, 88),
(93, 'ชุดเล็กอิ่มคุ้ม (59 บาท)', 59, 1, 59, 88),
(94, 'ชุดเล็กอิ่มคุ้ม (59 บาท)', 59, 1, 59, 88),
(95, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 3, 90, 89),
(96, 'บุฟเฟต์เด็ก (109 บาท)', 109, 1, 109, 89),
(97, 'บุฟเฟต์ผู้ใหญ่ (159 บาท)', 159, 2, 318, 89),
(98, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 30, 90),
(99, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 30, 90),
(100, 'ไอศกรีมไม่อั้น (30 บาท)', 30, 1, 30, 91),
(101, 'ไอศกรีมไม่อั้น (30 บาท)', 30, 1, 30, 91),
(102, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 129, 92),
(103, 'ไอศกรีมไม่อั้น (30 บาท)', 30, 1, 30, 93),
(104, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 129, 94),
(105, 'ไอศกรีมไม่อั้น (30 บาท)', 30, 1, 30, 95),
(106, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 1, 30, 99),
(107, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 129, 100),
(108, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 129, 100),
(109, 'บุฟเฟต์เด็ก (109 บาท)', 109, 1, 109, 101),
(110, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 3, 387, 101),
(111, 'เครื่องดื่มไม่อั้น (30 บาท)', 30, 2, 60, 102),
(112, 'ไอศกรีมไม่อั้น (30 บาท)', 30, 2, 60, 103),
(113, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 3, 387, 103),
(114, 'ไอศกรีมไม่อั้น (30 บาท)', 30, 3, 90, 104),
(115, 'ชุดใหญ่อิ่มแน่น (129 บาท)', 129, 1, 129, 104);

-- --------------------------------------------------------

--
-- Table structure for table `receipts`
--

CREATE TABLE `receipts` (
  `ref_id` int(11) NOT NULL,
  `date_time` datetime DEFAULT current_timestamp(),
  `table_id` int(11) DEFAULT NULL,
  `total_price` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `receipts`
--

INSERT INTO `receipts` (`ref_id`, `date_time`, `table_id`, `total_price`) VALUES
(1, '2023-03-12 20:20:33', 2, 200),
(2, '2023-03-12 21:06:41', 1, 900),
(3, '2023-03-12 23:08:26', 3, 100),
(4, '2023-03-12 23:08:50', 4, 200),
(5, '2023-03-12 23:08:57', 5, 300),
(7, '2023-03-12 23:11:01', 6, 400),
(8, '2023-03-13 00:39:42', 2, 1000),
(9, '2023-03-13 05:19:05', 1, 0),
(10, '2023-03-13 05:19:28', 1, 0),
(11, '2023-03-13 05:19:51', 2, 0),
(12, '2023-03-13 05:21:28', 1, 0),
(13, '2023-03-13 05:23:02', 1, 0),
(14, '2023-03-13 05:26:19', 1, 2),
(15, '2023-03-13 05:31:54', 1, 0),
(16, '2023-03-13 05:33:24', 1, 0),
(17, '2023-03-13 05:35:28', 1, 0),
(18, '2023-03-13 05:36:10', 1, 60),
(19, '2023-03-13 05:37:32', 1, 120),
(20, '2023-03-13 05:39:13', 2, 268),
(21, '2023-03-14 22:39:53', 1, 90),
(22, '2023-03-14 22:40:16', 1, 30),
(23, '2023-03-14 23:05:36', 1, 150),
(24, '2023-03-14 23:53:04', 1, 60),
(25, '2023-03-15 00:47:23', 1, 0),
(26, '2023-03-15 00:47:29', 1, 60),
(27, '2023-03-15 00:47:55', 1, 0),
(28, '2023-03-15 00:49:19', 1, 0),
(29, '2023-03-15 00:49:30', 1, 180),
(30, '2023-03-15 00:49:56', 1, 60),
(31, '2023-03-15 00:50:05', 2, 90),
(32, '2023-03-15 00:50:42', 2, 60),
(33, '2023-03-15 00:50:46', 1, 30),
(34, '2023-03-15 00:50:54', 2, 60),
(35, '2023-03-15 04:55:08', 1, 30),
(36, '2023-03-15 13:09:02', 1, 407),
(37, '2023-03-15 14:41:11', 2, 90),
(38, '2023-03-15 14:48:59', 1, 159),
(39, '2023-03-15 15:02:30', 1, 159),
(40, '2023-03-15 15:06:29', 1, 30),
(41, '2023-03-15 15:07:46', 1, 129),
(42, '2023-03-15 15:47:42', 1, 2),
(43, '2023-03-15 15:51:25', 1, 30),
(44, '2023-03-15 15:51:33', 1, 30),
(45, '2023-03-15 15:53:15', 1, 60),
(46, '2023-03-15 15:54:03', 1, 30),
(47, '2023-03-15 15:54:47', 1, 30),
(48, '2023-03-15 15:54:54', 1, 30),
(49, '2023-03-15 15:57:39', 1, 30),
(50, '2023-03-15 15:59:27', 1, 60),
(51, '2023-03-15 16:00:48', 1, 60),
(52, '2023-03-15 16:00:57', 1, 129),
(53, '2023-03-15 16:01:09', 1, 129),
(54, '2023-03-15 16:01:57', 1, 30),
(55, '2023-03-15 16:05:10', 1, 180),
(56, '2023-03-15 16:05:26', 3, 177),
(57, '2023-03-15 16:16:26', 1, 30),
(58, '2023-03-15 16:17:28', 1, 30),
(59, '2023-03-15 16:17:45', 1, 159),
(60, '2023-03-15 16:24:35', 1, 30),
(61, '2023-03-15 16:24:52', 1, 30),
(62, '2023-03-15 16:25:13', 1, 30),
(63, '2023-03-15 16:27:26', 1, 60),
(64, '2023-03-15 16:28:58', 1, 30),
(65, '2023-03-15 16:30:24', 1, 109),
(66, '2023-03-15 16:30:46', 2, 596),
(67, '2023-03-15 16:31:09', 2, 784),
(68, '2023-03-15 16:31:31', 4, 258),
(69, '2023-03-15 16:32:44', 3, 90),
(70, '2023-03-15 16:33:13', 3, 90),
(71, '2023-03-15 16:33:28', 4, 288),
(72, '2023-03-16 23:14:14', 1, 30),
(73, '2023-03-16 23:46:43', 1, 30),
(74, '2023-03-16 23:47:36', 1, 30),
(75, '2023-03-16 23:48:23', 1, 0),
(76, '2023-03-16 23:49:29', 1, 0),
(77, '2023-03-16 23:49:44', 1, 30),
(78, '2023-03-16 23:50:03', 1, 30),
(79, '2023-03-16 23:50:10', 1, 30),
(80, '2023-03-16 23:52:56', 1, 30),
(81, '2023-03-16 23:53:06', 1, 30),
(82, '2023-03-16 23:53:32', 1, 159),
(83, '2023-03-16 23:54:00', 1, 795),
(84, '2023-03-17 00:18:34', 3, 318),
(85, '2023-03-17 00:24:56', 4, 387),
(86, '2023-03-17 00:39:43', 1, 258),
(87, '2023-03-17 00:40:14', 1, 118),
(88, '2023-03-17 00:40:32', 1, 445),
(89, '2023-03-17 00:41:11', 1, 517),
(90, '2023-03-17 00:50:34', 1, 60),
(91, '2023-03-17 00:51:49', 1, 60),
(92, '2023-03-17 00:53:26', 1, 129),
(93, '2023-03-17 00:54:29', 1, 30),
(94, '2023-03-17 00:55:14', 1, 129),
(95, '2023-03-17 00:57:20', 1, 30),
(96, '2023-03-17 01:02:47', 1, 0),
(97, '2023-03-17 01:03:08', 1, 0),
(98, '2023-03-17 01:04:49', 1, 0),
(99, '2023-03-17 01:10:09', 1, 30),
(100, '2023-03-17 01:10:44', 1, 258),
(101, '2023-03-17 01:11:04', 3, 496),
(102, '2023-03-17 04:26:38', 1, 60),
(103, '2023-03-17 04:27:01', 1, 447),
(104, '2023-03-17 05:24:05', 2, 219);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`order_id`);

--
-- Indexes for table `receipts`
--
ALTER TABLE `receipts`
  ADD PRIMARY KEY (`ref_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `order_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=116;

--
-- AUTO_INCREMENT for table `receipts`
--
ALTER TABLE `receipts`
  MODIFY `ref_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=105;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
